Autodesk.Revit.DB.FilterStringRule.#ctor(Autodesk.Revit.DB.FilterableValueProvider,Autodesk.Revit.DB.FilterStringRuleEvaluator,System.String,System.Boolean)
Constructs an instance of FilterStringRule.
valueProvider:
A pointer to a "value provider" object that will extract values from a Revit document.
evaluator:
A pointer to the filter rule evaluator object that implements the desired test.
The built-in evaluators implement commonly used tests for strings such as begins-with,
ends-with, contains, equal, etc.
ruleString:
The user-supplied string against which strings from a Revit document will be tested.
caseSensitive:
If true, string comparisons will be done case-sensitively.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2011